Revit 2027 API
TextEditorOptions.ShowOpaqueBackground Property
 Show opaque background behind the text during editing.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowOpaqueBackground { get; set; }
Public Property ShowOpaqueBackground As Boolean
	Get
	Set
public:
property bool ShowOpaqueBackground {
	bool get ();
	void set (bool value);
}
member ShowOpaqueBackground : bool with get, set
Property Value
Boolean
Remarks
 If false, the background will be opaque or not depending on the edited text note's type Background setting. If true, the background behind the text will always be opaque during editing.
See Also
Reference
TextEditorOptions Class
Autodesk.Revit.UI Namespace